import type { ApiSchemas } from '@/shared/api/schema';

export const MOCK_CITIES: ApiSchemas['City'][] = [
  {
    uuid: '00000000-0000-4000-8000-000000000201',
    name: 'Самара',
    region: 'Самарская область',
  },
  {
    uuid: '00000000-0000-4000-8000-000000000202',
    name: 'Москва',
    region: 'Москва',
  },
  {
    uuid: '00000000-0000-4000-8000-000000000203',
    name: 'Казань',
    region: 'Республика Татарстан',
  },
  {
    uuid: '00000000-0000-4000-8000-000000000204',
    name: 'Екатеринбург',
    region: 'Свердловская область',
  },
];
